import "./homepage.scss";
import parthners from "./parthners.json";
import HomeSwipe from "../components/swipers/swiper_home";

export default function Homepage() {
  return (
    <div className="page-wrapper">
      {/* <img
        className="image-board"
        src="https://scontent.fods1-1.fna.fbcdn.net/v/t39.30808-6/271800785_1382167525568938_4854358669842992514_n.png?_nc_cat=110&ccb=1-7&_nc_sid=e3f864&_nc_ohc=kRp3UZA7kNUAX-EMula&_nc_oc=AQmg9LJTNTYGHVtWyapy8DLbnC8DF7IfUWtCQg9nZnbSqBwbhpuiudEfHk-NlwBtX1g&_nc_ht=scontent.fods1-1.fna&oh=00_AfDTQyUBu6f-L3YiWzjvROcU-bQu_nvizAAIpfsvmds0Lg&oe=64223EAB"
      ></img> */}
      <div className="containerh">
        <HomeSwipe />
        <div className="containerh__themes">
          <div className="sub-themes">
            <h2>Широкий спектр продукції</h2>
            <p>
              {" "}
              Наша компанія реалізує високотехнологічну кабельну продукцію, яка
              широко застосовується в системах при будівництві, на виробництві,
              енергозабезпеченні, на транспорті, в метрополітені, на залізницях
              і в інших галузях промисловості. Ми продаємо кабель, здатний
              забезпечити передачу електірічества в містах і навіть цілих
              країнах
            </p>
          </div>
          <div className="sub-themes">
            <h2>Поставки в будь-яку точку світу</h2>
            <p>
              {" "}
              Ми поставляємо нашу продукцію в усі міста України та ближнього
              зарубіжжя. Ми трепетно ​​ставимося до термінів і якості продукції,
              що поставляється
            </p>
          </div>
          <div className="sub-themes">
            <h2>Надійність і швидкість</h2>
            <p>
              {" "}
              Високі вимоги, яким відповідає наш кабель, дозволяє застосовувати
              його на об'єктах атомних електричних станціях України. Якість
              нашої продукції відповідає світовим стандартам, що підтверджують
              сертифікати
            </p>
          </div>
        </div>
      </div>
      <div className="containerh__description">
        <div className="article">
          <h2>Про Торговий дім «Одескабель»</h2>
          <p>
            {" "}
            Товариство з обмеженою відповідальністю «Торговий дім Одеського
            кабельного заводу «Одескабель»» спеціалізується на реалізації всього
            спектру кабельно-провідникової продукції провідних кабельних заводів
            України, Росії, Білорусії. Підприємство обладнане великими складами
            для рухомого зберігання товару. Тисячі і тисячі кілометрів кабелів і
            проводів охоплюють сьогодні весь світ. Торговий Дім «Одескабель»
            може запропонувати покупцеві найширший асортимент
            кабельно-провідникової продукції.
          </p>
        </div>
        <div className="article">
          <h2>Надійний партнер</h2>
          <p>
            Торговий Дім «Одескабель» — Ваш стабільний партнер з постачання
            кабельної продукції на багато підприємств України, а також ближнього
            і далекого зарубіжжя. Підприємство гнучко реагує на кон’юнктуру
            ринку, що дозволяє займати лідируючу позицію в цій галузі.
            Гарантована якість продукції, швидка відвантаження зі складів,
            гнучка система знижок, різні способи доставки, включаючи ж / д
            транспорт, роблять ТД «Одескабель» надійним партнером для
            взаємовигідного співробітництва.
          </p>
        </div>
        <div className="article">
          <h2>Вся наша кабельна продукція сертифікована</h2>
          <p>
            Ви можете переконатися в якості продукції, яку ми раді вам
            запропонувати. У нас є сертифікати якості та відповідності для
            кожної позиції кабельної продукції. Ви можете ознайомитися і при
            необхідності скачати сертифікати відповідності якості випускається
            нами.
          </p>
        </div>
      </div>
      <div className="containerh__parthners">
        <h2>Наші партнери</h2>
        <div className="parthners">
          {parthners.map((item) => {
            return (
              <div className="parthners__cart">
                <img className="parthners__img" src={item.img} />
                <p className="part-title">{item.title}</p>
                <a target="blanc" className="part" href={item.link}>
                  # {item.link}
                </a>
              </div>
            );
          })}
        </div>
      </div>
    </div>
  );
}
